Revit 2024 API
BuiltInFailures.SiteImportFailures Class
 Failures about SiteImport.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SiteImportFailures
Visual Basic
Public NotInheritable Class SiteImportFailures
Visual C++
public ref class SiteImportFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures
See Also
BuiltInFailures.SiteImportFailures Members
Autodesk.Revit.DB Namespace